Revit 2023 API
DirectShapeReferenceOptions Methods
The DirectShapeReferenceOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsValidReferenceName
 Validates that the input name can be assigned to a direct shape reference.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
DirectShapeReferenceOptions Class
Autodesk.Revit.DB Namespace